<?php
return [
    // 注册页面
    'reg_title2' => '注册',
    'reg_small_title'=>'创建一个账户',
    'reg_email'=>'请输入你的邮箱',
    'reg_code'=>'请输入验证码',
    'reg_pwd'=>'请输入密码',
    'reg_submit'=>'创建账户',
    'reg_get_code'=>'获取验证码',
    'reg_opt_too_fast'=>'操作太频繁，请稍后再试',
    'reg_success'=>'注册成功',
    'reg_fail'=>'请求失败，请重试',
    'reg_email_exist'=>'邮箱已被使用',
    'reg_fail_email'=>'邮件发送失败',
    'reg_fail_code'=>'验证码错误',
    'reg_code_send'=>'发送成功，请留意您的邮箱',
    'reg_msg_code'=>'验证码是：',
    'reg_msg_wel'=>'欢迎注册爱果会员，',
    'reg_code_time'=>'验证码半个小时后将失效',
    'reg_msg_title'=>'【u18】注册验证码',

    '密码'=>'密码',
    '确认密码'=>'确认密码',
    '提交'=>'提交',
    '用户名'=>'用户名',
    '编辑用户'=>'编辑用户',
    '编辑'=>'编辑',

    '未绑定微信'=>'未绑定微信（请在微信登陆）',
    '微信解绑'=>'微信解绑',

    //导航
    '爱果管理'=>'爱果管理',
    '任务管理'=>'任务管理',
    '智能搜索'=>'智能搜索(支持模糊IMEI序列号等)',
    '批量搜索'=>'批量搜索',
    '批量搜索提示'=>'批量按行搜索!&#13;&#10;支持IMEI/序列号/维修ID(支持模糊搜索)!&#13;&#10;一行一个',


    '用户设置'=>'用户设置',
    '退出登录'=>'退出登录',
    '用户选项'=>'用户选项',
    //创建订单页面
    '新建订单'=>'新建订单',
	'新建订单说明'=>'新建订单说明',
    '订单时间'=>'订单时间',
    '订单名称'=>'订单名称',
    '订单名称空白'=>'No orders, please create new orders.',
    //
    '智能添加'=>'智能添加',
    '智能添加提示'=>'1,支持从表格复制!(维修ID 序列号 IMEI)&#13;&#10;2,用空格隔开 比如：（序列号 维修号）&#13;&#10;&#13;&#10;3,支持更多更多（一行一台机子的信息，系统自动匹配格式)',
    '智能添加说明'=>'智能添加说明',

    '高级查询提示'=>array(
        1 => '1,支持从表格复制!(SN/IMEI)&#13;&#10;2,用空格隔开 比如：（序列号 SN/IMEI）&#13;&#10; &#13;&#10;3,支持更多（一行一台机子的信息，系统自动匹配格式)   &#13;&#10; &#13;&#10;注:查询购买日期 请选择[SN转IMEI]服务。',
        2 => '1,支持从表格复制!(SN/IMEI)&#13;&#10;2,用空格隔开 比如：（序列号 SN/IMEI）&#13;&#10; &#13;&#10;3,支持更多（一行一台机子的信息，系统自动匹配格式)   &#13;&#10; &#13;&#10;注：一旦下单无法退款,请谨慎下单。',
        3 => '1,支持从表格复制!(SN/IMEI)&#13;&#10;2,用空格隔开 比如：（序列号 SN/IMEI）&#13;&#10; &#13;&#10;3,支持更多（一行一台机子的信息，系统自动匹配格式)   &#13;&#10; &#13;&#10;注：1.案例由图片转换而来，会造成个别字段缺失，2.因为GSX的不确定性会引起查询延迟,3.一旦下单无法退款,请谨慎下单。',
        4 => '1,支持从表格复制!(SN/IMEI)&#13;&#10;2,用空格隔开 比如：（序列号 SN/IMEI）&#13;&#10;3,支持更多（一行一台机子的信息，系统自动匹配格式)   &#13;&#10; &#13;&#10;注：1.欧州国家只显示[欧盟]，2.香港、新加坡国别无法准确判断是香港还是新加坡，3.官换或官修查询的国别结果只显示更换地的国别,4.一旦下单无法退款。',
        ),

    'aiguo标题'=>'爱果经销商管理',
    'lists_标题'=>'爱果经销商订单管理',
    'lists_标题2'=>'苹果进货、销售、维修管理 ',
    '添加查询订单'=>'添加查询订单',

    'lists_进行中'=>'进行中',
    'lists_完成'=>'完成',
    'lists_进入列表'=>'进入列表',
    'lists_使用帮助'=>'使用帮助',

    '添加'=>'添加',
    '名称'=>'名称',
    '删除'=>'删除',
    '台'=>'台',
    '订单'=>'订单',
    '数量'=>'数量',
    '编号'=>'编号',
 

    '成功'=>'成功',
    '失败'=>'失败',

    '表格'=>'表格',
    '表格生成'=>'表格生成（勾选）',
    '表格下载'=>'表格下载（整单）',
    '操作'=>'操作',
    '删除勾选'=>'删除（勾选）',
    '个性化设置'=>'个性化设置',
    '监控'=>'监控',
    '开启监控'=>'打开监控',
    '取消监控'=>'取消监控',
    '标记销售'=>'标记销售',
    '取消销售'=>'取消销售',
    '销售'=>'销售',
    '进货价'=>'进货价',
    '出货价'=>'出货价',
    '取消'=>'取消',
    '客户'=>'客户',

    '批量查询'=>'批量查询',

    'imeiorsn'=>'IMEI/序列号',
    '状态进度'=>'状态/进度',
    '进度时间'=>'进度时间',
    '新机imei-sn'=>'新机IMEI/序列号',

//    //nb_cx_order_phone表判断类型
//    'is_guanhuan' => ['未知','官换','非官换'],
//    'id_lock' => ['未知','有锁','无锁'],
//    'id_lock_black' => ['未知','黑名单','不在黑名单'],
//    'net_lock' => ['未知','有锁','无锁'],
//    'net_lock_black' => ['未知','黑名单','不在黑名单'],
//    'weixui' => ['无知','维修中','不在维修'],
//    'status' => ['正常','序列号错误','串号错误','序列号被回收'],
//    'is_del' => ['正常','删除'],
//    'phone_jiechu' => ['未知','借出','未借出'],
//    'phone_jihuo' => ['未激活','已激活'],
//    'MDM' => ['未知','开','关'],
//    'phone_zhichi'=> ['未知','支持','不支持 贵宾服务90天'],
//    'buy_yanzheng' => ['未知','已验证','未验证'],

    //nb_cx_order_phone表判断类型
    'is_guanhuan' => array(
        '0'=>'未知',
        '1'=>'是',
        '2'=>'否'
    ),

    'id_lock' => array(
        '0'=>'未知',
        '1'=>'开启',
        '2'=>'关闭'
    ),

    'id_lock_black' => array(
        '0'=>'未知',
        '1'=>'黑',
        '2'=>'白'
    ),

    'net_lock' => array(
        '0'=>'未知',
        '1'=>'有锁',
        '2'=>'无锁'
    ),
    'net_lock_black' => array(
        '0'=>'未知',
        '1'=>'黑',
        '2'=>'白'
    ),

    'weixiu' => array(
        '0'=>'未知',
        '-1'=>'未维修',
        '-2'=>'未维修',
        '-3'=>'未维修',
        '-4'=>'维修中',
        '-5'=>'未维修',
        '-6'=>'未维修',
        '-7'=>'未维修'
    ),

    'status' => array(
        '0'=>'正常',
        '1'=>'序列号无效',
        '2'=>'串号错误',
        '3'=>'替换'
    ),

    'is_del' => array(
        '0'=>'正常',
        '1'=>'删除'
    ),
    'is_tihuan' => array(
        '0'=>'正常',
        '1'=>'已替换'
    ),

    'phone_jiechu' => array(
        '0'=>'未知',
        '1'=>'借出',
        '2'=>'未借出'
    ),

    'phone_jihuo' => array(
        '0'=>'未知',
        '1'=>'已激活',
        '2'=>'未激活'
    ),

    'MDM' => array(
        '0'=>'未知',
        '1'=>'开启',
        '2'=>'关闭'
    ),

    'phone_zhichi'=> array(
        '0'=>'未知',
        '1'=>'是',
        '2'=>'否'
    ),

    'buy_yanzheng' => array(
        '0'=>'未知',
        '1'=>'有',
        '2'=>'无'
    ),
    'is_pay' => array(
        '0'=>'未支付',
        '1'=>'等扣款',
        '2'=>'已扣款',
        '3'=>'退款'
    ),
    'yunyingshang' => array(
            '0'=>'待查询',
            '1'=>'已完成',
            '2'=>'错误'
        ),

    'baoxiu_type' => array(
        'PD'=>'AC+',
        'PP'=>'AC',
        'PE'=>'AC延保',
        'OO'=>'过保',
        'LI'=>'普保',
        'WJ'=>'未激活',
        'WG'=>'未验证'
    ),

    'server_status' => array(
        '0'=>'待查询',
        '1'=>'已完成',
        '2'=>'错误'
    ),
//积分记录
    'change_type' => array(
        '0'=>'未知',
        '1'=>'查询扣积分',
        '2'=>'高级查询积分变动',
        '3'=>'后台管理员修改',
        '4'=>'会员充值',
        '5'=>'监控开启扣积分',
        '6'=>'国别查询扣除积分'
    ),
    //销售国家
    'sale_country' => array(
        'china'=>'中国',
        'china hong kong'=>'中国香港',
        'united states'=>'美国',
        'japan' =>'日本',
        'czech. republic' =>"捷克",
        'taiwan' =>'中国台湾',
        'Russia' =>'俄罗斯',
        'united kingdom'=>'英国',
    ),
//    查询的类型
    'order_type' => array(
        '1'=>'基础查询',
        '2'=>'国别文字查询',
    ),
// 服务类型
    'server_id' => array(
        '1'=>'保修查询',
        '2'=>'ID锁查询',
        '3'=>'ID锁黑白',
        '4'=>'ID锁监控',
        '5'=>'网络锁',
        '6'=>'运营商',
        '7'=>'正在维修',
        '8'=>'网络锁监控',
        '9'=>'国别(文字)',
        '13'=>'案例国别(文字)',
        '15'=>'MDM锁',
        '16'=>'SN转IMEI'
    ),


];